import 'package:get/get.dart';
//
import '../model/salads_model.dart';

class FoodController extends GetxController {
  List<List<FoodModel>> foods = [
    [FoodModel(
      id: "1",
      img: "assets/images/3.png",
      title: "سالاد یونانی",
      subtitle: "به همراه سس مخصوص",
      price: 32.00,
      deliveryTime: "۱۵ دقیقه",
      description:
          "سالاد یونانی یکی از انواع سالادهای خوشمزه و بین المللی است که اصلت آن همانطور که از نامش مشخص است متعلق به کشور یونان می باشد. این سالاد خوشمزه و متفاوت از نظر ظاهری شباهت هایی هم به سالاد شیرازی ما ایرانی ها دارد.",
      quantity: 1,
    ),
    FoodModel(
      id: "2",
      img: "assets/images/2.png",
      title: "سالاد سزار",
      subtitle: "به همراه سس مخصوص",
      price: 24.00,
      deliveryTime: "۲۰ دقیقه",
      description:
          "سالاد سزار از محبوب ترین سالاد های بین المللی می باشد. سالادسزار اصالتی ایتالیای دارد و مانند دیگر غذا های ایتالیایی مانند پاستا و پیتزا در سراسر جهان پر طرفدار می باشد. سالاد سزار هم مانند پاستا با دستور تهیه های متفاوتی تهیه می شود.",
      quantity: 1,
    ),
    FoodModel(
      id: "3",
      img: "assets/images/3.png",
      title: "سالاد میوه",
      subtitle: "به همراه سس و لیمو",
      price: 60.00,
      deliveryTime: "۴۰ دقیقه",
      description:
      "سالاد میوه یکی از انواع سالادهای خوشمزه و پرطرفدار در سراسر جهان است که با انواع میوه ها تهیه می شود.",
      quantity: 1,
    ),
  ],
   [
    FoodModel(
      id: "4",
      img: "assets/images/4.png",
      title: "استیک مخصوص",
      subtitle: "به همراه سس مخصوص",
      price: 32.00,
      deliveryTime: "۱۵ دقیقه",
      description:
      "نام دیگرش کباب فرنگی است. یکی از غذاهای خوشمزه محبوب برای همه مردم ، که نام ها و دستور پخت های متفاوتی دارد. به عبارتی دیگر یک تیکه بزرگ از گوشت است معمولا گوشت گاو ولی گاهی گوشت ماهی هم استفاده می‌کنند. مثل ماهی آزاد، شیر، سالمون، ….",
      quantity: 1,
    ),
    FoodModel(
      id: "5",
      img: "assets/images/4.png",
      title: "خورشت فسنجان",
      subtitle: "به همراه دوغ",
      price: 24.00,
      deliveryTime: "۲۰ دقیقه",
      description:
      "خورش فِسِنجان یا فَسوجن یکی از خورش‌های اصیل ایرانی است. در پخت این خورش از مغز گردو و رب انار ترش استفاده میشود اما آرد مغز پسته، یا بادم، رب انار ترش و شیرین و رب آلوچه ترش هم به دلخواه به همراه قطعات کوچک گوشت مرغ یا گوشت قرمز استفاده می‌شود و با پلو مصرف می‌شود.",
      quantity: 1,
    ),
    FoodModel(
      id: "6",
      img: "assets/images/4.png",
      title: "پیتزا سبزیجات",
      subtitle: "به همراه سس",
      price: 32.00,
      deliveryTime: "۱۵ دقیقه",
      description:
      "در میان غذاهای فست ‌فودی و انتخاب‌ های متنوعی که در این زمینه وجود دارند، پیتزا همیشه حرف اول و آخر را می ‌ز‌ند و طرفدارن پروپا قرصی نیز در میان گروه‌ های سنی مختلف دارد. وقتی حرف از پیتزا به میان می ‌آید، بیشتر افراد ناخواسته به یاد انواع گوشت می ‌افتند.",
      quantity: 1,
    ),
  ],  [
      FoodModel(
        id: "7",
        img: "assets/images/7.png",
        title: "خوراک میگو",
        subtitle: "به همراه سبزیجات",
        price: 57.00,
        deliveryTime: "50 دقیقه",
        description:
        "میگو پلو یکی از انواع غذاهای خوشمزه و پرطرفدار ایرانی است که با دستورهای بسیار متنوعی تهیه می شود. این غذای خوشمزه یکی از معورف ترین غذاهای استان های جنوبی کشورمان است و بهترین میگو پلو در جنوب کشور متعلق به استان بوشهر می باشد. میگو پلو را اگر به صورت پلو مخلوط درست کنیم خوشمزه تر است.",
        quantity: 1,
      ),
      FoodModel(
        id: "8",
        img: "assets/images/8.png",
        title: "ماهی سالمون",
        subtitle: "به همراه دوغ",
        price: 28.00,
        deliveryTime: "۲۰ دقیقه",
        description:
        "ماهی سالمون از خانواده ماهی آزاد است که در رودخانه های آب شیرین تخم ریزی می کنند و در اقیانوس آتلانتیک زندگی می کنند. گوشت ماهی های سالمون به رنگ صورتی است. این نوع ماهی از نظر ویتامین C و E غنی است ",
        quantity: 1,
      ),
      FoodModel(
        id: "9",
        img: "assets/images/9.png",
        title: "خوراک ماهی",
        subtitle: "به همراه سس",
        price: 35.00,
        deliveryTime: "۱0 دقیقه",
        description:
        "ماهی سالمون از خانواده ماهی آزاد است که در رودخانه های آب شیرین تخم ریزی می کنند و در اقیانوس آتلانتیک زندگی می کنند. گوشت ماهی های سالمون به رنگ صورتی است. این نوع ماهی از نظر ویتامین C و E غنی است ",
        quantity: 1,
      ),
    ]];

}
